app/controllers/deck_controller.rb

  def index
    @decks = Deck.all
---
SELECT "decks".* FROM "decks"